org/notes/cs.org
#+TITLE: 資訊工程
#+OPTIONS: H:2
#+HTML_LINK_HOME: ../index.html
#+HTML_LINK_UP: ../index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="/blog/css/readtheorg.css" />

* Assignment V.S. Binding

所謂的 Functional Language 的變數不可改其實是不精確的。實際上它只是將變數分的更嚴謹，可修改，與不可修改。
先來說說什麼是 Binding. Binding 指的是將一個符號綁定在一個值，綁定後就不可修改，這個符號稱之為變數。以自然語言來理解的話，其實就是代名詞。

#+BEGIN_QUOTE
favonia: 一個變數沒有指到一個值。一個變數可以被一個值取代，但不會儲存什麼內容在裡面。
#+END_QUOTE

所以說下面這個例子， 必須理解為3.14的另一個稱呼叫做 PI, 而不是 PI 這個容器的值是 3.14。而  1 + PI 這個式子的另一個稱呼是 result, 而不是 1 + PI 運算後，將值放到 result 這個容器裡。 不管是PI，還是 result 都只是個代稱，而不是容器。

#+BEGIN_SRC javascript
PI = 3.14
result = 1.0 + PI
#+END_SRC

接下來搭配 SML 來解釋什麼是 Assignment。
下面這段 code 是說 PI 是 3.14的binding, result 是 1 + PI 的binding。
程式執行時(runtime) 會把 PI 這個變數代換成3.14。

#+BEGIN_SRC javascript
val PI = 3.14
val result = 1.0 + PI
#+END_SRC 

那如果需要可修改的變數怎麼辦，SML 可以讓變數綁在值的的指標上, ref 3.14
指的是 3.14 這個值得指標指標。而因為指標指定的值是可以變的，所以現在
PI 可以當成是可以修改的。 PI := 4 只是讓 PI 的值(也就是指標) 從 3.14
指到 4，並不會產生新的binding。

#+BEGIN_SRC javascript
val PI = ref 3.14 # binding
val result = 1.0 + PI # binding
val PI := 4 # assign
#+END_SRC

因此，在所有的 imperative language 裡，不管是Python, Ruby, C, Java, 
變數其實都是被綁在指標上，這樣變數指到的值才能被修改。

所以說，變數只是個值的代稱，如果值是指標，那麼就可以修改指標要指到哪個
值，反之則不行。
但不管怎麼說，變數都不應該被當成是一個容器。

* Study Of Coordination Language And Models
** Patterns
- [[http://workflowpatterns.com][Workflow Patterns]]
- [[http://communicationtheory.org/patterns-of-communication/][Communication Patters]]
- Dsitrubuted Computing Software Architecture Pattern
  - [[http://www.cs.wustl.edu/~schmidt/POSA/POSA4/][Pattern-Oriented Software Architecture: A Pattern Language for Distributed Computing]]
- Enterprise Intergration Patterns
  - [[http://www.enterpriseintegrationpatterns.com/toc.html][Messaging Patterns]]
** Coordination Language And Models
*** Papers
**** Coordination models and languages, GA Papadopoulos, F Arbab, 1999
***** The concept of coordination is by no means limited to Computer Science.
Malone and Crowston characterise coordination as an emerging research area with an interdisciplinary focus,
playing a key issue in many diverse disciplines such as economics and operational  research,  organisation theory  and  biology.
***** What is Coordination Model
- the glue that binds separate activities into an ensemble.
- The need of Multilingual and Heterogeneous Systems
*****  Coordination works well  on distributed/parallel programming.
Programming a distributed or parallel system can be seen as the combination of two distinct activities: the actual
computing part comprising a number of processes involved in manipulating data and a coordination part responsible for
the communication and cooperation between the processes. Thus, coordination can be used to distinguish the computational
concerns of some distributed or parallel application from the communication ones, allowing the separate development but also
the eventual amalgamation of the these two major development phases.
***** Data-Driven
- The main characteristic of the data-driven coordination models and languages is the fact that the state of the computation at any moment
  in time is defined in terms of both the values of the data being received or sent and the actual configuration of the coordinated components.
- A data-driven coordination language typically offers some coordination primitives (coupled with a coordination metaphor) which are mixed within
  the purely computational part of  the  code.  These  primitives  do  encapsulate  in  a  useful  way  the  communication  and configurational
  aspects of some computation, but must be used in conjunction with the purely computational manipulation of data associated with some process.
  This means that processes cannot easily be distinguished as either coordination or computational processes.
****** Data-Driven Model - Shared Data Space
- Almost all coordination models belonging to this category have evolved around the notion of a *Shared Dataspace*.
- A *Shared  Dataspace* is a common, content-addressable  data structure. All processes involved in some computation can communicate among themselves only indirectly via this medium.
  this metaphor achieves decoupling of processes in both space and time.
****** Data-Driven Model - Message-passing

****** Data-Driven Model - Compositional Programming
- A compositional programming system is one in which properties of program
  components are preserved when those components are composed in parallel
  with other program components.
  Thus, it is possible to define in a compositional way recurring patterns
  of parallel computation, whether configuration ones (such as mapping techniques)
  or communication ones (such as streamers  and  mergers),  as  building  blocks
  and  combine  them  together  to  form  bigger programs.
- 2 approachs
  - *concurrent logic programming*
  - *functional programming*
***** Control-Driven
- the coordinated framework evolves by means of observing state changes in processes
  and, possibly, broadcast of events. Contrary to the case of the data-driven family
  where coordinators directly handle and examine data values, here processes
  (whether coordination or computational ones) are treated as black boxes; data handled
  within a  process is of no concern to the environment of the process.
- Processes communicate with their environment by means of clearly defined interfaces,
  usually referred to as input or output ports. Producer-consumer relationships are formed
  by means of setting up stream or channel connections between output ports of producers
  and input ports of consumers. By nature, these connections are point-to-point, although
  limited  broadcasting functionality  is  usually  allowed  by  forming  1-n
  relationships  between  a  producer  and  n consumers and vice versa.
- Most of the coordination languages to be described in this section realise in one way or
  another the above *CSP*- or *Occam-like* formalism.
- *static reconfiguration* v.s. *dynamic reconfiguration*
- [[http://projects.cwi.nl/manifold/][MANIFOLD]]
