blog/notes/cs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-03-27 Sun 17:19 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>資訊工程</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Chen Hsin-Yi" />
<link rel="stylesheet" type="text/css" href="/blog/css/readtheorg.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">資訊工程</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">Assignment V.S. Binding</a></li>
<li><a href="#orgheadline63">Study Of Coordination Language And Models</a>
<ul>
<li><a href="#orgheadline2">Patterns</a></li>
<li><a href="#orgheadline16">Coordination Language And Models</a></li>
<li><a href="#orgheadline20">Web Services Compositions</a></li>
<li><a href="#orgheadline62">Data Flow</a></li>
</ul>
</li>
<li><a href="#orgheadline64">Flow-Based Programming 2ND Edition, J. Paul Morrison</a>
<ul>
<li><a href="#orgheadline65">Terms</a></li>
<li><a href="#orgheadline66">Mentioned People</a></li>
<li><a href="#orgheadline108">Notes</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Assignment V.S. Binding</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
所謂的 Functional Language 的變數不可改其實是不精確的。實際上它只是將變數分的更嚴謹，可修改，與不可修改。
先來說說什麼是 Binding. Binding 指的是將一個符號綁定在一個值，綁定後就不可修改，這個符號稱之為變數。以自然語言來理解的話，其實就是代名詞。
</p>

<blockquote>
<p>
favonia: 一個變數沒有指到一個值。一個變數可以被一個值取代，但不會儲存什麼內容在裡面。
</p>
</blockquote>

<p>
所以說下面這個例子， 必須理解為3.14的另一個稱呼叫做 PI, 而不是 PI 這個容器的值是 3.14。而  1 + PI 這個式子的另一個稱呼是 result, 而不是 1 + PI 運算後，將值放到 result 這個容器裡。 不管是PI，還是 result 都只是個代稱，而不是容器。
</p>

<div class="org-src-container">

<pre class="src src-javascript">PI = <span style="color: #a45bad;">3</span>.<span style="color: #a45bad;">14</span>
result = <span style="color: #a45bad;">1</span>.<span style="color: #a45bad;">0</span> + PI
</pre>
</div>

<p>
接下來搭配 SML 來解釋什麼是 Assignment。
下面這段 code 是說 PI 是 3.14的binding, result 是 1 + PI 的binding。
程式執行時(runtime) 會把 PI 這個變數代換成3.14。
</p>

<div class="org-src-container">

<pre class="src src-javascript">val PI = <span style="color: #a45bad;">3</span>.<span style="color: #a45bad;">14</span>
val result = <span style="color: #a45bad;">1</span>.<span style="color: #a45bad;">0</span> + PI
</pre>
</div>

<p>
那如果需要可修改的變數怎麼辦，SML 可以讓變數綁在值的的指標上, ref 3.14
指的是 3.14 這個值得指標指標。而因為指標指定的值是可以變的，所以現在
PI 可以當成是可以修改的。 PI := 4 只是讓 PI 的值(也就是指標) 從 3.14
指到 4，並不會產生新的binding。
</p>

<div class="org-src-container">

<pre class="src src-javascript">val PI = ref <span style="color: #a45bad;">3</span>.<span style="color: #a45bad;">14</span> # binding
val result = <span style="color: #a45bad;">1</span>.<span style="color: #a45bad;">0</span> + PI # binding
val PI := <span style="color: #a45bad;">4</span> # assign
</pre>
</div>

<p>
因此，在所有的 imperative language 裡，不管是Python, Ruby, C, Java, 
變數其實都是被綁在指標上，這樣變數指到的值才能被修改。
</p>

<p>
所以說，變數只是個值的代稱，如果值是指標，那麼就可以修改指標要指到哪個
值，反之則不行。
但不管怎麼說，變數都不應該被當成是一個容器。
</p>
</div>
</div>

<div id="outline-container-orgheadline63" class="outline-2">
<h2 id="orgheadline63">Study Of Coordination Language And Models</h2>
<div class="outline-text-2" id="text-orgheadline63">
</div><div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">Patterns</h3>
<div class="outline-text-3" id="text-orgheadline2">
<ul class="org-ul">
<li><a href="http://workflowpatterns.com/">Workflow Patterns</a></li>
<li><a href="http://communicationtheory.org/patterns-of-communication/">Communication Patters</a></li>
<li>Dsitrubuted Computing Software Architecture Pattern
<ul class="org-ul">
<li><a href="http://www.cs.wustl.edu/~schmidt/POSA/POSA4/">Pattern-Oriented Software Architecture: A Pattern Language for Distributed Computing</a></li>
</ul></li>
<li>Enterprise Intergration Patterns
<ul class="org-ul">
<li><a href="http://www.enterpriseintegrationpatterns.com/toc.html">Messaging Patterns</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16">Coordination Language And Models</h3>
<div class="outline-text-3" id="text-orgheadline16">
</div><ul class="org-ul"><li><a id="orgheadline15"></a>Papers<br  /><ul class="org-ul"><li><a id="orgheadline14"></a>Coordination models and languages, GA Papadopoulos, F Arbab, 1999<br  /><ul class="org-ul"><li><a id="orgheadline3"></a>The concept of coordination is by no means limited to Computer Science.<br  /><div class="outline-text-6" id="text-orgheadline3">
<p>
Malone and Crowston characterise coordination as an emerging research area with an interdisciplinary focus,
playing a key issue in many diverse disciplines such as economics and operational  research,  organisation theory  and  biology.
</p>
</div></li>
<li><a id="orgheadline4"></a>What is Coordination Model<br  /><div class="outline-text-6" id="text-orgheadline4">
<ul class="org-ul">
<li>the glue that binds separate activities into an ensemble.</li>
<li>The need of Multilingual and Heterogeneous Systems</li>
</ul>
</div></li>
<li><a id="orgheadline5"></a>Coordination works well  on distributed/parallel programming.<br  /><div class="outline-text-6" id="text-orgheadline5">
<p>
Programming a distributed or parallel system can be seen as the combination of two distinct activities: the actual
computing part comprising a number of processes involved in manipulating data and a coordination part responsible for
the communication and cooperation between the processes. Thus, coordination can be used to distinguish the computational
concerns of some distributed or parallel application from the communication ones, allowing the separate development but also
the eventual amalgamation of the these two major development phases.
</p>
</div></li>
<li><a id="orgheadline6"></a>Data-Driven<br  /><div class="outline-text-6" id="text-orgheadline6">
<ul class="org-ul">
<li>The main characteristic of the data-driven coordination models and languages is the fact that the state of the computation at any moment
in time is defined in terms of both the values of the data being received or sent and the actual configuration of the coordinated components.</li>
<li>A data-driven coordination language typically offers some coordination primitives (coupled with a coordination metaphor) which are mixed within
the purely computational part of  the  code.  These  primitives  do  encapsulate  in  a  useful  way  the  communication  and configurational
aspects of some computation, but must be used in conjunction with the purely computational manipulation of data associated with some process.
This means that processes cannot easily be distinguished as either coordination or computational processes.</li>
</ul>
</div>
<ul class="org-ul"><li><a id="orgheadline7"></a>Data-Driven Model - Shared Data Space<br  /><div class="outline-text-7" id="text-orgheadline7">
<ul class="org-ul">
<li>Almost all coordination models belonging to this category have evolved around the notion of a <b>Shared Dataspace</b>.</li>
<li>A <b>Shared  Dataspace</b> is a common, content-addressable  data structure. All processes involved in some computation can communicate among themselves only indirectly via this medium.
this metaphor achieves decoupling of processes in both space and time.</li>
</ul>
</div></li>
<li><a id="orgheadline8"></a>Data-Driven Model - Message-passing<br  /></li>

<li><a id="orgheadline9"></a>Data-Driven Model - Compositional Programming<br  /><div class="outline-text-7" id="text-orgheadline9">
<ul class="org-ul">
<li>A compositional programming system is one in which properties of program
components are preserved when those components are composed in parallel
with other program components.
Thus, it is possible to define in a compositional way recurring patterns
of parallel computation, whether configuration ones (such as mapping techniques)
or communication ones (such as streamers  and  mergers),  as  building  blocks
and  combine  them  together  to  form  bigger programs.</li>
<li>2 approachs
<ul class="org-ul">
<li><b>concurrent logic programming</b></li>
<li><b>functional programming</b></li>
</ul></li>
</ul>
</div></li></ul></li>
<li><a id="orgheadline10"></a>Control-Driven<br  /><div class="outline-text-6" id="text-orgheadline10">
<ul class="org-ul">
<li>the coordinated framework evolves by means of observing state changes in processes
and, possibly, broadcast of events. Contrary to the case of the data-driven family
where coordinators directly handle and examine data values, here processes
(whether coordination or computational ones) are treated as black boxes; data handled
within a  process is of no concern to the environment of the process.</li>
<li>Processes communicate with their environment by means of clearly defined interfaces,
usually referred to as input or output ports. Producer-consumer relationships are formed
by means of setting up stream or channel connections between output ports of producers
and input ports of consumers. By nature, these connections are point-to-point, although
limited  broadcasting functionality  is  usually  allowed  by  forming  1-n
relationships  between  a  producer  and  n consumers and vice versa.</li>
<li>Most of the coordination languages to be described in this section realise in one way or
another the above <b>CSP</b>- or <b>Occam-like</b> formalism.</li>
<li><b>static reconfiguration</b> v.s. <b>dynamic reconfiguration</b></li>
<li><a href="http://projects.cwi.nl/manifold/">MANIFOLD</a></li>
</ul>
</div></li>
