blog/notes/cs.html
<li><a id="orgheadline11"></a>Comparision Between Data-Driven and Control-Driven<br  /><div class="outline-text-6" id="text-orgheadline11">
<ul class="org-ul">
<li>In the case of the data-driven category, the coordination component is usually a set of primitives with predefined functionality which is used in connection with
some “host” computational language, in the control-driven category the coordination component is usually a fully-fledged language.</li>
<li>The data-driven category tends to be used mostly for parallelising computational problems. The control-driven category tends to be used primarily for modelling systems.</li>
<li>the data- vs. control-driven separation is by no means a clear cut one.</li>
</ul>
</div></li>
<li><a id="orgheadline12"></a>Major Dimensions Of Coordination Model<br  /><div class="outline-text-6" id="text-orgheadline12">
<ul class="org-ul">
<li>the entities being coordinated</li>
<li>the mechanism of coordination</li>
<li>the coordination medium or architecture</li>
<li>the semantics, rules of protocols of coordination employed</li>
<li>whether a model supports a different (from the computational component) coordination language or involves the use of “add-on” primitives</li>
<li>whether a model supports and encourages the use of many computational languages</li>
<li>what is the most relevant application domain for each  model</li>
<li>what is the implementation status of the proposed framework.</li>
</ul>
</div></li>
<li><a id="orgheadline13"></a>Concerned Issues<br  /><div class="outline-text-6" id="text-orgheadline13">
<ul class="org-ul">
<li>flat unstructured communication medium v.s. hierarchical levels of their communication medium</li>
<li>port-to-port connections via streams with static/dymaic reconfiguration support.</li>
<li>channnled-based v.s. medium-based</li>
</ul>
</div></li></ul></li></ul></li></ul>
</div>

<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20">Web Services Compositions</h3>
<div class="outline-text-3" id="text-orgheadline20">
</div><ul class="org-ul"><li><a id="orgheadline19"></a>Papers<br  /><ul class="org-ul"><li><a id="orgheadline17"></a>van der Aalst, W.M.P, Dumas, M. ; ter Hofstede, A.H.M..  (2003). Web Service Composition Languages: Old Wine in New Bottles?. IEEE.<br  /></li>
<li><a id="orgheadline18"></a>Luca Cardelli and Rowan Davies. . (1997). Service Combinators for Web Computing. IEEE.<br  /></li></ul></li></ul>
</div>
<div id="outline-container-orgheadline62" class="outline-3">
<h3 id="orgheadline62">Data Flow</h3>
<div class="outline-text-3" id="text-orgheadline62">
</div><ul class="org-ul"><li><a id="orgheadline24"></a>Books<br  /><ul class="org-ul"><li><a id="orgheadline21"></a>Morrison, J. P. (1994). Flow-based programming. Van Nostrand Reinhold.<br  /></li>
<li><a id="orgheadline22"></a>Van-Roy, P., &amp; Haridi, S. (2004). Concepts, techniques, and models of computer programming. MIT press.<br  /></li>
<li><a id="orgheadline23"></a>Matt Carkci. (2014). Dataflow and Reactive Programming Systems. Leanpub.<br  /></li></ul></li>
<li><a id="orgheadline61"></a>Papers<br  /><ul class="org-ul"><li><a id="orgheadline25"></a>Kelly, J. L., Lochbaum, C., &amp; Vyssotsky, V. A. (1961). A block diagram compiler. Bell System Technical Journal, 40(3), 669-676.<br  /></li>
<li><a id="orgheadline26"></a>Sutherland, W. R. (1966). ON-LINE GRAPHICAL SPECIFICATION OF COMPUTER PROCEDURES (No. TR-405). LINCOLN LAB MASS INST OF TECH LEXINGTON.<br  /></li>
<li><a id="orgheadline27"></a>Rodrigues, J. E., &amp; Rodriguez Bezos, J. E. (1969). A Graph Model for Parallel Computations.<br  /></li>
<li><a id="orgheadline28"></a>Dennis, J. B. (1972). On the design and specification of a common base language (No. MAC-TR-101). MASSACHUSETTS INST OF TECH CAMBRIDGE PROJECT MAC.<br  /></li>
<li><a id="orgheadline29"></a>Dennis, J. B. (1974, January). First version of a data flow procedure language. In Programming Symposium (pp. 362-376). Springer Berlin Heidelberg.<br  /></li>
<li><a id="orgheadline30"></a>Gilles, K. A. H. N. (1974). The semantics of a simple language for parallel programming. In In Information Processing’74: Proceedings of the IFIP Congress (Vol. 74, pp. 471-475).<br  /></li>
<li><a id="orgheadline31"></a>Karp, R. M., &amp; Miller, R. E. (1966). Properties of a model for parallel computations: Determinacy, termination, queueing. SIAM Journal on Applied Mathematics, 14(6), 1390-1411.<br  /></li>
<li><a id="orgheadline32"></a>Karp, R. M., &amp; Miller, R. E. (1966). Properties of a model for parallel computations: Determinacy, termination, queueing. SIAM Journal on Applied Mathematics, 14(6), 1390-1411.<br  /></li>
<li><a id="orgheadline33"></a>Nikhil, R. S. (1989, April). Can dataflow subsume von Neumann computing?. In ACM SIGARCH Computer Architecture News (Vol. 17, No. 3, pp. 262-272). ACM.<br  /></li>
<li><a id="orgheadline34"></a>Karp, R. M., &amp; Miller, R. E. (1966). Properties of a model for parallel computations: Determinacy, termination, queueing. SIAM Journal on Applied Mathematics, 14(6), 1390-1411.<br  /></li>
<li><a id="orgheadline35"></a>Berry, G. (1989). Real time programming: Special purpose or general purpose languages.<br  /></li>
<li><a id="orgheadline36"></a>Lee, E. (1991). Consistency in dataflow graphs. Parallel and Distributed Systems, IEEE Transactions on, 2(2), 223-235.<br  /></li>
<li><a id="orgheadline37"></a>Buck, J., &amp; Lee, E. A. (1992, May). The token flow model. In Data Flow Workshop.<br  /></li>
<li><a id="orgheadline38"></a>Hils, D. D. (1992). Visual languages and computing survey: Data flow visual programming languages. Journal of Visual Languages &amp; Computing, 3(1), 69-101.<br  /></li>
<li><a id="orgheadline39"></a>Hurson, A. R., Hurson, A. R., Lee, B., &amp; Lee, B. (1993). Issues in dataflow computing. Adv. in Comput, 37(285-333), 38-39.<br  /></li>
<li><a id="orgheadline40"></a>Buck, J. T., &amp; Lee, E. A. (1993, April). Scheduling dynamic dataflow graphs with bounded memory using the token flow model. In Acoustics, Speech, and Signal Processing, 1993. ICASSP-93., 1993 IEEE International Conference on (Vol. 1, pp. 429-432). IEEE.<br  /></li>
<li><a id="orgheadline41"></a>Bhattacharyya, S. S., &amp; Lee, E. A. (1994). Looped schedules for dataflow descriptions of multirate signal processing algorithms. Formal Methods in System Design, 5(3), 183-205.<br  /></li>
<li><a id="orgheadline42"></a>Bhattacharyya, S. S., Buck, J. T., Ha, S., &amp; Lee, E. A. (1995). Generating compact code from dataflow specifications of multirate signal processing algorithms. Circuits and Systems I: Fundamental Theory and Applications, IEEE Transactions on, 42(3), 138-150.<br  /></li>
<li><a id="orgheadline43"></a>Parks, T. M. (1995). Bounded scheduling of process networks (Doctoral dissertation, University of California). Chicago<br  /></li>
<li><a id="orgheadline44"></a>Parks, T. M., Pino, J. L., &amp; Lee, E. A. (1995, October). A comparison of synchronous and cycle-static dataflow. In Signals, Systems and Computers, 1995. 1995 Conference Record of the Twenty-Ninth Asilomar Conference on (Vol. 1, pp. 204-210). IEEE.<br  /></li>
<li><a id="orgheadline45"></a>Lee, E. A., &amp; Parks, T. M. (1995). Dataflow process networks. Proceedings of the IEEE, 83(5), 773-801.<br  /></li>
<li><a id="orgheadline46"></a>Verdoscia, L. O. R. E. N. Z. O. (1996). ALFA fine grain dataflow machine. International Programming, ma orgun and ea ashcroft edition.<br  /></li>
<li><a id="orgheadline47"></a>Lee, E. A. (1997). A denotational semantics for dataflow with firing. Electronics Research Laboratory, College of Engineering, University of California.<br  /></li>
<li><a id="orgheadline48"></a>Robic, B., Silc, J., &amp; Ungerer, T. (2000). Beyond dataflow. Journal of Computing and Information Technology, 8(2), 89-102.<br  /></li>
<li><a id="orgheadline49"></a>Lee, B. (2000). Specification and design of reactive systems (Doctoral dissertation, UNIVERSITY of CALIFORNIA).<br  /></li>
<li><a id="orgheadline50"></a>Liu, J., &amp; Lee, E. A. (2002). A component-based approach to modeling and simulating mixed-signal and hybrid systems. ACM Transactions on Modeling and Computer Simulation (TOMACS), 12(4), 343-368.<br  /></li>
<li><a id="orgheadline51"></a>Johnston, W. M., Hanna, J. R., &amp; Millar, R. J. (2004). Advances in dataflow programming languages. ACM Computing Surveys (CSUR), 36(1), 1-34.<br  /></li>
<li><a id="orgheadline52"></a>Petersen, A., Putnam, A., Mercaldi, M., Schwerin, A., Eggers, S., Swanson, S., &amp; Oskin, M. (2006, September). Reducing control overhead in dataflow architectures. In 「Proceedings of the 15th international conference on Parallel architectures and compilation techniques (pp. 182-191). ACM.<br  /></li>
<li><a id="orgheadline53"></a>Lee, E. A. (2009). Computing needs time. Communications of the ACM, 52(5), 70-79.<br  /></li>
<li><a id="orgheadline54"></a>Arandi, S., &amp; Evripidou, P. (2010, July). Programming multi-core architectures using data-flow techniques. In Embedded Computer Systems (SAMOS), 2010 International Conference on (pp. 152-161). IEEE.<br  /></li>
