blog/notes/cs.html
<li><a id="orgheadline55"></a>Lee, E. A., &amp; Varaiya, P. (2011). Structure and interpretation of signals and systems, Second Edition, LeeVaraiya.org.<br  /></li>
<li><a id="orgheadline56"></a>Amsden, E. (2011). A survey of functional reactive programming. Unpublished.<br  /></li>
<li><a id="orgheadline57"></a>Sousa, T. B. (2012). Dataflow Programming Concept, Languages and Applications. In Doctoral Symposium on Informatics Engineering.<br  /></li>
<li><a id="orgheadline58"></a>Odersky, M., &amp; Maier, I. (2012). Deprecating the Observer Pattern with Scala. React (No. EPFL-REPORT-176887).<br  /></li>
<li><a id="orgheadline59"></a>Mishra, V., &amp; Oney, K. Predictive Block Dataflow Model for Parallel Computation.<br  /></li>
<li><a id="orgheadline60"></a>Chakilam, S. R. A. K. C., &amp; O’Neil, T. W. STATIC SCHEDULING FOR CYCLO STATIC DATA FLOW GRAPHS.<br  /></li></ul></li></ul>
</div>
</div>

<div id="outline-container-orgheadline64" class="outline-2">
<h2 id="orgheadline64">Flow-Based Programming 2ND Edition, J. Paul Morrison</h2>
<div class="outline-text-2" id="text-orgheadline64">
</div>
<div id="outline-container-orgheadline65" class="outline-3">
<h3 id="orgheadline65">Terms</h3>
<div class="outline-text-3" id="text-orgheadline65">
<dl class="org-dl">
<dt>Configurable modularity</dt><dd>a term coined by Raoul de Campo of IBM Research and later expanded on by Nate Edwards of the same organization, denoting the ability to reuse independent components by changing their interconnections, but not their internals.<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> In Edwards' view this characterizes all successful reuse systems, and indeed all systems which can be described as "engineered".</dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline66" class="outline-3">
<h3 id="orgheadline66">Mentioned People</h3>
<div class="outline-text-3" id="text-orgheadline66">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-right">Page</th>
<th scope="col" class="org-left">Purpose</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Wayne Stevens</td>
<td class="org-right">5</td>
<td class="org-left">強調FBP會成為典範轉移的重要因素</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">David Gelernter</td>
<td class="org-right">7</td>
<td class="org-left">指出FBP是 Coordination Language的一種例子</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Nicholas Carriero</td>
<td class="org-right">7</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Raoul de Campo</td>
<td class="org-right">7</td>
<td class="org-left">介紹Raoul 研究的 "configurable modularity</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Nate Edwards</td>
<td class="org-right">7</td>
<td class="org-left">指出Nate Edwards 的 configurable modularity 研究篇硬體所以沒被重視</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Jackson 1975</td>
<td class="org-right">24</td>
<td class="org-left">指出 Design 跟 Impleentartion 在FBP的概念</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>

<ul class="org-ul"><li><a id="orgheadline67"></a><a href="https://en.wikipedia.org/wiki/Wayne_Stevens">Wayne Stevens</a><br  /><div class="outline-text-4" id="text-orgheadline67">
<ul class="org-ul">
<li>A software engineer, chief architect of application development methodology 
for IBM's consulting group.</li>
<li>Important works are 
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Structured_analysis">Structured Design</a></li>
</ul></li>
</ul>
</div></li>

<li><a id="orgheadline68"></a><a href="https://en.wikipedia.org/wiki/David_Gelernter">David Gelernter</a><br  /><div class="outline-text-4" id="text-orgheadline68">
<ul class="org-ul">
<li>Parallel Computation</li>
</ul>
</div></li>
<li><a id="orgheadline69"></a>Nicholas Carriero<br  /></li></ul>
</div>

<div id="outline-container-orgheadline108" class="outline-3">
<h3 id="orgheadline108">Notes</h3>
<div class="outline-text-3" id="text-orgheadline108">
</div><ul class="org-ul"><li><a id="orgheadline70"></a>Chaoter 0: Prologue<br  /><div class="outline-text-4" id="text-orgheadline70">
<p>
作者自介自己的成長背景，大學在 King's college 就讀人類學系，並且強調將人類行為轉換成符號邏輯是件很困難的事情
在他的IBM生涯中，不斷碰觸到IBM電腦的瓶頸，這使得他開始專注在一個基本問題 - 為什麼在電腦上開發程式這麼困難，當要讓電腦做一些人類覺得很簡單的事情時。
</p>
</div>
<ul class="org-ul"><li><a id="orgheadline71"></a>Reusable Code<br  /><div class="outline-text-5" id="text-orgheadline71">
<p>
作者寫過 Compiler (BABEL), 也寫過 Interpreter (BLIS), 而在那個年代已經有 reusable subroutine library，只是幾乎都是一次性函數, 
像是*binary function*, 他曾試圖撰寫通用的大量更新的*function*, 但卻失敗了(只支援少數的資料集合), 這些經驗讓他開始思考是否有另一種方式
可以產生可再用的程式碼。
</p>
</div></li>
<li><a id="orgheadline72"></a>Rapid Prototyping<br  /><div class="outline-text-5" id="text-orgheadline72">
<p>
作者相信不管做任何事，只要有懷疑的地方，就先做出一個 prototyping, 並認為好的 prototyping 是可以一直成長，直到成為完整的系統。
並提到[David的書:1]也有說到數種結合互動式開發與Milestone的放式。
</p>
</div></li>
<li><a id="orgheadline73"></a>Focus Of This Book<br  /><div class="outline-text-5" id="text-orgheadline73">
<p>
The approach mentioned hre is for bussiness applications, not mathematical applications.
</p>
</div></li>
<li><a id="orgheadline74"></a>Thinking things visual term<br  /><div class="outline-text-5" id="text-orgheadline74">
<p>
由於他媽媽使母親的關係，使他在成長過程中常使用圖像式思考，在這本書提到的很重要的一點是使用圖像是符號來開發程式，有個好處是能利用到人類的圖像思考能力。
間或提到 [GPSS:2]對他的影響，使他在介紹資料處理時是從單一 Record，而非電腦邏輯。(作者沒有電腦科學訓練)
</p>
</div></li>
<li><a id="orgheadline75"></a>Application Design is a creative activity<br  /></li>
<li><a id="orgheadline76"></a>Fun<br  /><div class="outline-text-5" id="text-orgheadline76">
<ul class="org-ul">
<li>The word "amateur" comes from the idea of loving. One should be proud to be called an computing amateur.</li>
<li>If an activity isn't fun, humans probaly shouldn't be doing it.</li>
<li>The guys who turn out the most code are the ones who are having fun! - P.R Ewing.</li>
<li>Play is not something we have to put away when we reach the state of adulthood</li>
</ul>
</div></li></ul></li>
<li><a id="orgheadline77"></a>Chpater 1: Introduction<br  /><div class="outline-text-4" id="text-orgheadline77">
<p>
敘述FBP實作的應用程式很容易被修改以達成目標，並強調這是個存在四十年以上且被驗證的技術。
讓開發者專注在data transformation的方式，而不是procedural code，讓開發者專注在快速開發，產生跟容易維護的系統。
同時，FBP也很適合分散式運算。
作者同時指出，FBP需要數天到數週的學習時間。因為FBP背後隱含的思考模型與傳統程式相當不同。
要把sequencial program改成支援multiplethread很困難，而 Von Neumann Computer Model 是讓程式開發非常困難的原因之一
</p>
</div>
<ul class="org-ul"><li><a id="orgheadline78"></a>FBP != Data Flow<br  /><div class="outline-text-5" id="text-orgheadline78">
<ul class="org-ul">
<li>flow-based programming shares some basic concept with dataflow 
architectures in computer design, but they are still not the same.</li>
<li>作者認為要使用FBP是因為dataflow archtecture 不包含control flow的部分，而FBP包含，
因此要使用另一個名稱以方便區隔。</li>
<li>其他大多數 data flow programming 專注在數學運算，但FBP不僅僅是</li>
<li>作者曾有過的模擬器經驗，讓他意識到若讓物件在這些運算中流動，會有更好的生產力。</li>
</ul>
</div></li>
<li><a id="orgheadline79"></a>Entity flow throw the network<br  /><div class="outline-text-5" id="text-orgheadline79">
<ul class="org-ul">
<li>each entity reoresents an object with attributes.</li>
<li>the term <b>entity</b>, <b>object</b> is too often used in many aspects, to more be 
cliafied, the author defines a new term <b>Information Packets</b>.</li>
</ul>
</div></li>
<li><a id="orgheadline80"></a>打預防針<br  /><div class="outline-text-5" id="text-orgheadline80">
<ul class="org-ul">
<li>避免讀者快速下結論說FBP就只是&#x2026;, 而放棄了閱讀</li>
</ul>
</div></li></ul></li>
<li><a id="orgheadline81"></a>Chapter 2: High-Level Languages, 4GLs and Source Code Reuse<br  /></li>
<li><a id="orgheadline82"></a>Chapter 3: Basic Concepts<br  /></li>
<li><a id="orgheadline83"></a>Chapter 4: Reuse of components<br  /></li>
<li><a id="orgheadline84"></a>Chapter 5: Parametrization of Reusable Components<br  /></li>
<li><a id="orgheadline85"></a>Chapter 6: Composite Components<br  /></li>
<li><a id="orgheadline86"></a>Chapter 7: Building Components &amp; Some More Simple Applications<br  /></li>
<li><a id="orgheadline87"></a>Chapter 8: Substreams and Control IPs<br  /><div class="outline-text-4" id="text-orgheadline87">
<ul class="org-ul">
<li>大約有1/4 商業程式是在做 Update，用非FBP做會非常困難。</li>
</ul>
</div></li>
<li><a id="orgheadline88"></a>Chapter 9: Some more components and Simple Applications<br  /></li>
<li><a id="orgheadline89"></a>Chapter 10: Data Descriptions and Descriptors<br  /></li>
<li><a id="orgheadline90"></a>Chapter 11: Tree Structure<br  /></li>
<li><a id="orgheadline91"></a>Chapter 12: Scheduling Rules<br  /></li>
<li><a id="orgheadline92"></a>Chapter 13: Loop-Type Networks<br  /></li>
<li><a id="orgheadline93"></a>Chapter 14: Implementation, Network Splitting and Client-Server<br  /></li>
<li><a id="orgheadline94"></a>Chapter 15: Deadlocks: Their Causes and Prevention<br  /></li>
<li><a id="orgheadline95"></a>Chapter 16: Problem-Oriented Mini Language<br  /></li>
<li><a id="orgheadline96"></a>Chapter 17: A Bussiness-Oriented Very High Level Language<br  /></li>
<li><a id="orgheadline97"></a>Chapter 18: Synchronization and Checkpoints<br  /></li>
<li><a id="orgheadline98"></a>Chapter 19: General Framwork for Interactive Applications<br  /></li>
<li><a id="orgheadline99"></a>Chapter 20: Performance Considerations<br  /></li>
<li><a id="orgheadline100"></a>Chapter 21: Defining Networks<br  /></li>
<li><a id="orgheadline101"></a>Chapter 22: Related Compiler Theory Concepts<br  /></li>
<li><a id="orgheadline102"></a>Chapter 23: Streams and Recursive Function Definitions<br  /></li>
<li><a id="orgheadline103"></a>Chapter 24: Comparison between FBP and Object-Oriented Porgramming<br  /></li>
<li><a id="orgheadline104"></a>Chapter 25: Related Concepts and Forerunners<br  /></li>
<li><a id="orgheadline105"></a>Chapter 26: The FBP Explosion<br  /></li>
